<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class LaboratorySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $companies = [
            ['name' => 'شركة الرازي محدودة المسؤولية'],
            ['name' => 'مختبرات شرق المتوسط للصناعات الدوائية المحدودة المسؤولية'],
            ['name' => 'معمل هيومن فارما'],
            ['name' => 'زين فارما للصناعات الدوائية'],
            ['name' => 'شركة شفا للصناعات الدوائية'],
            ['name' => 'معمل المدينة الدوائية المحدودة المسؤولية / سيتي فارما /'],
            ['name' => 'معمل السعد للصناعات الدوائية'],
            ['name' => 'مختبرات آسيا للصناعات الدوائية'],
            ['name' => 'الشركة الوطنية للصناعات الدوائية'],
            ['name' => 'شركة ابن زهر للصناعات الصيدلانية المساهمة المغفلة الخاصة'],
            ['name' => 'شركة أوبري للصناعات الدوائية المحدودة المسؤولية'],
            ['name' => 'شركة مسعود للمحاليل الطبية المحدودة المسؤولية'],
            ['name' => 'معمل الشهباء لصناعة الادوية البشرية'],
            ['name' => 'معمل اوشر فارما'],
            ['name' => 'الشرق للأدوية البشرية'],
            ['name' => '/الفا / المحدودة المسؤولية'],
            ['name' => 'أم سي بي كيور فارما المحدودة المسؤولية M.C.P CURE PHARMA L.L. C'],
            ['name' => 'معمل الأفق للصناعات الدوائية'],
            ['name' => 'معمل ميرسي فارما'],
            ['name' => 'شركة ابن الهيثم للصناعات الدوائية'],
            ['name' => 'معمل الرائد للصناعات الدوائية'],
            ['name' => 'شركة دومنا للصناعة الدوائية'],
            ['name' => 'شركة المستقبل للصناعات الدوائية'],
            ['name' => 'شركة كسبار وشعباني فارما'],
            ['name' => 'روبى'],
            ['name' => 'الشركة السورية للدواء ( فارماسير)'],
            ['name' => 'معمل مسعود فارما'],
            ['name' => 'شركة ساندي فارما'],
            ['name' => 'معمل دلتا للصناعات الدوائية'],
            ['name' => 'معمل يونيفارما للصناعات الدوائية محدودة المسؤولية'],
            ['name' => 'بركات للصناعات الدوائية محدودة المسؤولية'],
            ['name' => 'راشا للادوية'],
            ['name' => 'ميديوتيك'],
            ['name' => 'شركة ميديكو'],
            ['name' => 'حماة للصناعات الدوائية'],
            ['name' => 'الزعبي اخوان- الفارس'],
            ['name' => 'معمل ابن رشد للصناعات الدوائية'],
            ['name' => 'شركة البلسم للصناعات الدوائية ومواد التجميل'],
            ['name' => 'معمل لاما فارما للصناعات الدوائية'],
            ['name' => 'معمل اليوسف ج/ G'],
            ['name' => 'شركة راما للصناعات الدوائية'],
            ['name' => 'معمل ابن حيان للصناعات الدوائية'],
            ['name' => 'المتوسط للصناعات الدوائية محدودة المسؤولية'],
            ['name' => 'المختبرات الطبية الصيدلانية / ميديفارم /'],
            ['name' => 'معمل القنواتي للصناعات الدوائية'],
            ['name' => 'شركة يونيشيما للصناعات الدوائية'],
            ['name' => 'دياموند فارما'],
            ['name' => 'شركة بحري الطبية المحدودة المسؤولية'],
            ['name' => 'معمل فيتا فارما'],
            ['name' => 'معمل النورس للصناعات الدوائية'],
            ['name' => 'اوغاريت للصناعات الدوائية'],
            ['name' => 'سيفكو'],
            ['name' => 'معمل سيردا فارما للمحاليل الطبية'],
            ['name' => 'معمل غولدن ميدفارما'],
            ['name' => 'افاميا للصناعات الدوائية'],
            ['name' => 'معمل التراميديكا للصناعات الدوائية'],
            ['name' => 'معمل تاميكو- ريف دمشق - المليحة'],
            ['name' => 'معمل اميسا'],
            ['name' => 'كيمي للصناعات الدوائية'],
            ['name' => 'شركة بيوميد فارما المحدودة المسؤولية'],
            ['name' => 'حياة فارما للصناعات الدوائية'],
            ['name' => 'ماجيكو'],
            ['name' => 'شركة سيفارما للصناعات الدوائية'],
            ['name' => 'شركة عمريت للدواء'],
            ['name' => 'شركة عبد الوهاب القنواتي للمستحضرات الطبية المساهمة المغفلة الخاصة'],
            ['name' => 'شركة برولاين فارما'],
            ['name' => 'شركة المتحدة للصناعات الدوائية المحدودة المسؤولية'],
            ['name' => 'مختبرات غاما للصناعات الدوائية المحدودة المسؤولية'],
            ['name' => 'يونايتد فارما'],
            ['name' => 'معمل ترياق للصناعات الدوائية'],
            ['name' => 'شركة الشرق الاوسط لصناعة الادوية البشرية المحدودة المسؤولية- ميغافارما'],
            ['name' => 'معمل ابن سينا فرع 1 للصناعات الدوائية - ريف دمشق'],
            ['name' => 'معمل سلامة كيرللصناعات الدوائية'],
            ['name' => 'معمل الدولية للدواء اي دي م i d m'],
            ['name' => 'شركة معتوق فارما محدودة المسؤولية'],
            ['name' => 'معمل مياميد للصناعات الدوائية'],
            ['name' => 'معمل الفارابي'],
            ['name' => 'معمل شمرا فارما'],
            ['name' => 'شركة السلام للصناعات الدوائية'],
            ['name' => 'معمل سراج للصناعات الدوائية - سراج فارما'],
            ['name' => 'الشام (شامكو)'],
            ['name' => 'آسكو فارما'],
            ['name' => 'شركة المعرفة للصناعات الدوائية ( ألما المساهمة المغفلة)'],
            ['name' => 'معمل الديماس لصناعة الادوية'],
            ['name' => 'الحسن'],
            ['name' => 'شركة أدامكو'],
            ['name' => 'كندة للصناعات الدوائية'],
            ['name' => 'شركة فكتوريا/ VICTORIA / للصناعات الدوائية المحدودة المسؤولية'],
            ['name' => 'معمل ملكارت للصناعات الدوائية'],
        ];

        collect($companies)->chunk(100)->each(function ($chunk) {
            DB::table('laboratories')->insert($chunk->toArray());
        });
    }
}
