<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class Pharmaceutical_FormSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {

        $pharmaceutical_form = [
            ['name' => 'شراب'],
            ['name' => 'أقراص ملبسة'],
            ['name' => 'تحاميل'],
            ['name' => 'معلق جاف'],
            ['name' => 'أقراص'],
            ['name' => 'محلول للحقن/حبابات'],
            ['name' => 'محافظ'],
            ['name' => 'محافظ جيلاتينية طرية'],
            ['name' => 'سيروم'],
            ['name' => 'محلول للحقن/فيال'],
            ['name' => 'بودرة للحقن/فيال'],
            ['name' => 'محافظ مديدة التحرر'],
            ['name' => 'قطرة عينية'],
            ['name' => 'أقراص للمضغ'],
            ['name' => 'جل'],
            ['name' => 'محلول'],
            ['name' => 'كريم'],
            ['name' => 'بخاخ أنفي'],
            ['name' => 'أقراص ملبسة معوياً'],
            ['name' => 'مرهم عيني\\غرام'],
            ['name' => 'ظروف'],
            ['name' => 'بودرة موضعية'],
            ['name' => 'كريم شرجي'],
            ['name' => 'مرهم'],
            ['name' => 'نقط فموية'],
            ['name' => 'أقراص متفتتة فموياً'],
            ['name' => 'أقراص فوارة'],
            ['name' => 'أقراص مديدة التحرر'],
            ['name' => 'فيال فموي'],
            ['name' => 'معلق فموي'],
            ['name' => 'جل أنفي'],
            ['name' => 'أقراص ثنائية الطبقة'],
            ['name' => 'ظروف / شراب'],
            ['name' => 'قطرة أذن'],
            ['name' => 'بخة محددة'],
            ['name' => 'محافظ للاستنشاق'],
            ['name' => 'مرهم مهبلي'],
            ['name' => 'محافظ متأخرة التحرر'],
            ['name' => 'كريم مهبلي'],
            ['name' => 'بيوض مهبلية'],
            ['name' => 'قطرة انف'],
            ['name' => 'أقراص متأخرة التحرر'],
            ['name' => 'حزمة (محافظ+أقراص ملبسة+ أقراص ملبسة)'],
            ['name' => 'أقراص ثنائية الطبقة مديدة التحرر'],
            ['name' => 'بخاخ'],
            ['name' => 'محلول للاستنشاق/حبابات'],
            ['name' => 'أقراص مص'],
            ['name' => 'غسول فموي'],
            ['name' => 'جل مهبلي'],
            ['name' => 'ماء معد للارواء'],
            ['name' => 'أقراص تحت اللسان'],
            ['name' => 'رحضة شرجية'],
            ['name' => 'حزمة (أقراص+ أقراص ملبسة)'],
            ['name' => 'مخدر سني/ خرطوش'],
            ['name' => 'محلول للاستنشاق'],
            ['name' => 'شامبو'],
            ['name' => 'سائل تخدير'],
            ['name' => 'معلق للحقن'],
            ['name' => 'ماء محل'],
            ['name' => 'مرهم شرجي'],
            ['name' => 'قطرة عينية /أذنية'],
            ['name' => 'قطرة عينية انفيةأذنية'],
            ['name' => 'أقراص مهبلية'],
            ['name' => 'محلول للحقن/كيس سيروم(P.V.C.)'],
            ['name' => 'معجون'],
            ['name' => 'بخاخ فموي'],
            ['name' => 'معجون فموي'],
            ['name' => 'الكسير'],
            ['name' => 'جل عيني'],
            ['name' => 'جل فموي'],
            ['name' => 'قطرة عينية \\جرعة وحيدة'],
            ['name' => 'مستحلب جلدي'],
            ['name' => 'محلول تسريب وريدي/ عبوة او كيس'],
            ['name' => 'محلول أظافر'],
            ['name' => 'أقراص للمضغ/قابلة للتبعثر'],
            ['name' => 'أقراص قابلة للإسالة'],
            ['name' => 'أقراص لتحضير معلق فموي'],
            ['name' => 'بودرة /فموي'],
            ['name' => 'علكة'],
            ['name' => 'سيرنغ معبأ/للحقن'],
            ['name' => 'رذاذ'],
            ['name' => 'شراب وحيد الجرعة'],
            ['name' => 'حزمة (أقراص ملبسة+ أقراص ملبسة)'],
            ['name' => 'محلول عيني'],
            ['name' => 'أقراص (قرص ضمن قرص)'],
            ['name' => 'شاش طبي']
        ];

        collect($pharmaceutical_form)->chunk(100)->each(function ($chunk) {
            DB::table('pharmaceutical_forms')->insert($chunk->toArray());
        });
    }

}
